tutorials/catalyticZonesReactingFoam/methanePartialOxidation/constant/mechanism/thermo.catalyst
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "mechanism";
    object      reactions.catalyst;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

gas
{
    #include "thermo.gas"
}

solid
{
    #include "thermo.surf"
}

// ************************************************************************* //
