tutorials/catalyticZonesReactingFoam/methanePartialOxidation/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.
\*---------------------------------------------------------------------------*/

type            sets;
libs            ("libsampling.so");

writeControl    writeTime;

interpolationScheme cellPoint;

setFormat       csv;

sets
(
    line
    {
        type    lineUniform;   
        axis    y;
        nPoints 101;
        start   (0.0001 0 0);
        end     (0.0001 0.01 0);
    }
);

fields  
(
    p
    T
    CH4
    O2
    H2O
    H2
    CO
    CO2
    AR
    thermo:rho
    PT(S).catalyst
    O(S).catalyst
    OH(S).catalyst
    CO(S).catalyst
);

// ************************************************************************* //
